{
  "Title": "Time series and frequency-based model for anomaly fault detectionfor a desalination pump using machine and deep learning",
  "Author": "Hussain Ghonem",
  "AuthorEmail": "hussainghonem99@gmail.com",
  "Language": "English",
  "Genres": [
    "Research",
    "Educational",
    "Technology",
    "Academic",
    "Scientific Research",
    "Case Studies",
    "Thesis",
    "Research Papers",
    "Research Methodology"
  ],
  "Description": "In Egypt, water scarcity is the major issue concerning the life of a nation that has survived for thousands of years. The Egyptian water per capita is less than 600 cubic meters per year, surpassing the water poverty limit which is 1,000 cubic meters per capita a year. The use of seawater desalination pumps employing Reverse Osmosis (RO) technology offers a solution to Egypt’s water shortage challenge. My graduation project will build up a model prototype that will detect anomalies without the need for human interventions and cut the costs of traveling and checking up on the desalination pumps. The system will be trained using time-series data that is granted to me by the faculty of Engineering at the British University in Egypt. The model will be able to classify the time series data, predict the label, and detect the anomalies from the time series using machine and deep learning techniques. My methodology is that I have done a literature survey with a background in doing anomaly detection on real-life devices. Then starts the analysis process of the results that have come out from the literature survey the analysis process is very important to know how the writers have evaluated their models which model performs better when or where does it perform better than other models that main methods and how different they are. I have received two data sets from the faculty of engineering the first one is the normal data set which came from a desalination pump that does work in a normal condition and the second data set came from a desalination pump that does work in a cavitational condition and the goal is to detect the anomalies in cavitation data set by training on the normal data set. None of the data sets were labeled so that does make the project turns into unsupervised learning. I have done the EDA to the two data sets that I received and discovered some differences between the data sets for example the correlation of the features in the normal data set is more than the correlation of the features in the cavitation data set. Then I started to choose the main methods which were chosen according to the data set size, type, and recommendation. Then I started to choose an algorithm or a model for each method. The algorithms that are going to be used are the long short-term memory network LSTM, the Gated Recurrent Unit GRU, the Isolation Forest, and the one-class SVM. The one-class SVM approach uses the one-class classification method, the LSTM works well with the unbalanced data sets and detects anomalies by using the local and the global outlier then calculates the loss using the MAE, the Isolation Forest is the fastest between them and works by finding the anomalies by the patterns and these patterns are expected to be few and very different, and the GRU does works by discovering the correlations between among time and frequency sequence then use the Gaussian mixture to detect the anomalies. The models that were trained using the normal data set to learn it and to be able to predict the anomalies based on the threshold that the model/me chooses it. I have tested different types of methods and models and all the models were successful except the one-class SVM frequency-based model that has failed in the two approaches the dynamic pressure and the vibration approach. This means that the one-class methods will not work as efficiently when using the frequency-based instead of the time series. So based on that discovery the anomaly detection models that I have created for this study except the one-class SVM frequency-based model could be applied to desalination pumps to have a field test. On the other side we can see that “Bi_GRU01 frequency for dynamic pressure approach” model achieved the best results and it's loss to time graph was clean without any noises. This model also had the Least MAE difference. So we need more study to know which performance measures indicated that this model will outperform the other models. Is it the MAE Cavitational loss or the MAE Difference loss. Based on these results, we could say that the dynamic pressure approach with the frequency-based data is the optimal approach for this case and that the “Bi_GRU01 frequency” model could be used as a benchmark for further studies.",
  "Cover": "/Books/4/1BookCover.png",
  "Pdf": "/Books/4/1748010929134.pdf"
}